In [7]:
import pandas as pd 
df=pd.read_csv("all_040_in_01.P1.csv")
df.head()

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,1,40,1,NaN,NaN,NaN,NaN,NaN,Alabama,4779736,2171853,4447100,1963711,4779736,4447100